None
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_2 (InputLayer)         (None, None, None, 256)   0
_________________________________________________________________
pyramid_regression_0 (Conv2D (None, None, None, 256)   590080
_________________________________________________________________
pyramid_regression_1 (Conv2D (None, None, None, 256)   590080
_________________________________________________________________
pyramid_regression_2 (Conv2D (None, None, None, 256)   590080
_________________________________________________________________
pyramid_regression_3 (Conv2D (None, None, None, 256)   590080
_________________________________________________________________
pyramid_regression (Conv2D)  (None, None, None, 36)    82980	注：卷积核全部是3*3，padding全部是same
_________________________________________________________________
pyramid_regression_reshape ( (None, None, 4)           0		注：上一层中最后是36个通道，每4个通道的一个点组成一个anchor的边框修正，最初一共设了9个anchors
=================================================================
Total params: 2,443,300
Trainable params: 2,443,300
Non-trainable params: 0
_________________________________________________________________
None